In [4]:
import numpy as np
import pandas as pd

/usr/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 216, got 192
  return f(*args, **kwds)
/usr/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 216, got 192
  return f(*args, **kwds)

In [5]:
data_set = pd.read_csv('trip.csv')

In [6]:
data_set.describe()

            Duration  Start station number  End station number
count  374115.000000         374115.000000       374115.000000
mean     1261.837144          31321.624460        31322.260757
std      2423.195856            220.156373          217.183046
min        60.000000          31000.000000        31000.000000
25%       441.000000          31208.000000        31212.000000
50%       769.000000          31258.000000        31257.000000
75%      1322.000000          31500.000000        31408.000000
max     86181.000000          32227.000000        32227.000000

In [7]:
data_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 374115 entries, 0 to 374114
Data columns (total 9 columns):
Duration                374115 non-null int64
Start date              374115 non-null object
End date                374115 non-null object
Start station number    374115 non-null int64
Start station           374115 non-null object
End station number      374115 non-null int64
End station             374115 non-null object
Bike number             374115 non-null object
Member type             374115 non-null object
dtypes: int64(3), object(6)
memory usage: 25.7+ MB

In [8]:
data_set.isnull().sum()

Duration                0
Start date              0
End date                0
Start station number    0
Start station           0
End station number      0
End station             0
Bike number             0
Member type             0
dtype: int64

In [9]:
data_set.head()

,Duration,Start date,End date,Start station number,Start station,End station number,End station,Bike number,Member type
0,679,2018-05-01 00:00:00,2018-05-01 00:11:19,31302,Wisconsin Ave & Newark St NW,31307,3000 Connecticut Ave NW / National Zoo,W22771,Member
1,578,2018-05-01 00:00:20,2018-05-01 00:09:59,31232,7th & F St NW / National Portrait Gallery,31609,Maine Ave & 7th St SW,W21320,Casual
2,580,2018-05-01 00:00:28,2018-05-01 00:10:09,31232,7th & F St NW / National Portrait Gallery,31609,Maine Ave & 7th St SW,W20863,Casual
3,606,2018-05-01 00:01:22,2018-05-01 00:11:29,31104,Adams Mill & Columbia Rd NW,31509,New Jersey Ave & R St NW,W00822,Member
4,582,2018-05-01 00:04:52,2018-05-01 00:14:34,31129,15th St & Pennsylvania Ave NW/Pershing Park,31118,3rd & Elm St NW,W21846,Member

In [10]:
from sklearn.preprocessing import LabelEncoder

In [11]:
le = LabelEncoder()
data_set['Member type'] = le.fit_transform(data_set['Member type'])

In [12]:
data_set.head()

,Duration,Start date,End date,Start station number,Start station,End station number,End station,Bike number,Member type
0,679,2018-05-01 00:00:00,2018-05-01 00:11:19,31302,Wisconsin Ave & Newark St NW,31307,3000 Connecticut Ave NW / National Zoo,W22771,1
1,578,2018-05-01 00:00:20,2018-05-01 00:09:59,31232,7th & F St NW / National Portrait Gallery,31609,Maine Ave & 7th St SW,W21320,0
2,580,2018-05-01 00:00:28,2018-05-01 00:10:09,31232,7th & F St NW / National Portrait Gallery,31609,Maine Ave & 7th St SW,W20863,0
3,606,2018-05-01 00:01:22,2018-05-01 00:11:29,31104,Adams Mill & Columbia Rd NW,31509,New Jersey Ave & R St NW,W00822,1
4,582,2018-05-01 00:04:52,2018-05-01 00:14:34,31129,15th St & Pennsylvania Ave NW/Pershing Park,31118,3rd & Elm St NW,W21846,1

In [13]:
data_set = data_set.drop(columns=['Bike number','Start station','End station'])

In [14]:
data_set.head()

,Duration,Start date,End date,Start station number,End station number,Member type
0,679,2018-05-01 00:00:00,2018-05-01 00:11:19,31302,31307,1
1,578,2018-05-01 00:00:20,2018-05-01 00:09:59,31232,31609,0
2,580,2018-05-01 00:00:28,2018-05-01 00:10:09,31232,31609,0
3,606,2018-05-01 00:01:22,2018-05-01 00:11:29,31104,31509,1
4,582,2018-05-01 00:04:52,2018-05-01 00:14:34,31129,31118,1

In [15]:
data_set['Start date'] = le.fit_transform(data_set['Start date'])

In [16]:
data_set['End date'] = le.fit_transform(data_set['End date'])

In [17]:
data_set.head()

,Duration,Start date,End date,Start station number,End station number,Member type
0,679,0,3,31302,31307,1
1,578,1,1,31232,31609,0
2,580,2,2,31232,31609,0
3,606,3,4,31104,31509,1
4,582,4,5,31129,31118,1

In [18]:
X = data_set.iloc[:,:-1]
Y = data_set.iloc[:,-1]

In [19]:
X.head()

   Duration  Start date  End date  Start station number  End station number
0       679           0         3                 31302               31307
1       578           1         1                 31232               31609
2       580           2         2                 31232               31609
3       606           3         4                 31104               31509
4       582           4         5                 31129               31118

In [20]:
Y.head()

0    1
1    0
2    0
3    1
4    1
Name: Member type, dtype: int64

In [23]:
from sklearn.tree import DecisionTreeClassifier 
from sklearn.model_selection import train_test_split

In [24]:
model = DecisionTreeClassifier()

In [25]:
x_train ,x_test ,y_train ,y_test = train_test_split(X,Y,test_size =0.2)

In [26]:
model.fit(x_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [27]:
model.score(x_test,y_test)

0.8035898052737794